iotexpert/emb2018/PSoC Creator/EMB2018/EW2018_Accel_Final.cydsn/bmi160_defs.h
/**\name UTILITY MACROS	*/
#define BMI160_SET_LOW_BYTE     UINT16_C(0x00FF)
#define BMI160_SET_HIGH_BYTE    UINT16_C(0xFF00)

#define BMI160_GET_LSB(var)	(uint8_t)(var & BMI160_SET_LOW_BYTE)
#define BMI160_GET_MSB(var)	(uint8_t)((var & BMI160_SET_HIGH_BYTE) >> 8)

/*****************************************************************************/
/* type definitions */
typedef int8_t (*bmi160_com_fptr_t)(uint8_t dev_addr, uint8_t reg_addr,
		uint8_t *data, uint16_t len);

typedef void (*bmi160_delay_fptr_t)(uint32_t period);

/*************************** Data structures *********************************/

struct bmi160_pmu_status {
	/*! Power mode status of Accel
	 * Possible values :
	 *  - BMI160_ACCEL_PMU_SUSPEND
	 *  - BMI160_ACCEL_PMU_NORMAL
	 *  - BMI160_ACCEL_PMU_LOW_POWER
	 */
	uint8_t accel_pmu_status;
	/*! Power mode status of Gyro
	 * Possible values :
	 *  - BMI160_GYRO_PMU_SUSPEND
	 *  - BMI160_GYRO_PMU_NORMAL
	 *  - BMI160_GYRO_PMU_FSU
	 */
	uint8_t gyro_pmu_status;
	/*! Power mode status of 'Auxiliary sensor interface' whereas the actual
	 *  power mode of the aux. sensor should be configured
	 *  according to the connected sensor specifications
	 * Possible values :
	 *  - BMI160_AUX_PMU_SUSPEND
	 *  - BMI160_AUX_PMU_NORMAL
	 *  - BMI160_AUX_PMU_LOW_POWER
	 */
	uint8_t aux_pmu_status;
};
/*!
 * @brief bmi160 interrupt status selection enum.
 */
enum bmi160_int_status_sel {
	BMI160_INT_STATUS_0 = 1,
	BMI160_INT_STATUS_1 = 2,
	BMI160_INT_STATUS_2 = 4,
	BMI160_INT_STATUS_3 = 8,
	BMI160_INT_STATUS_ALL = 15
};

/*!
 * @brief bmi160 interrupt status bits structure
 */
struct bmi160_int_status_bits {
#if LITTLE_ENDIAN == 1
	uint32_t step :1;
	uint32_t sigmot :1;
	uint32_t anym :1;
	/* pmu trigger will be handled later */
	uint32_t pmu_trigger_reserved :1;
	uint32_t d_tap :1;
	uint32_t s_tap :1;
	uint32_t orient :1;
	uint32_t flat_int :1;
	uint32_t reserved :2;
	uint32_t high_g :1;
	uint32_t low_g :1;
	uint32_t drdy :1;
	uint32_t ffull :1;
	uint32_t fwm :1;
	uint32_t nomo :1;
	uint32_t anym_first_x :1;
	uint32_t anym_first_y :1;
	uint32_t anym_first_z :1;
	uint32_t anym_sign :1;
	uint32_t tap_first_x :1;
	uint32_t tap_first_y :1;
	uint32_t tap_first_z :1;
	uint32_t tap_sign :1;
	uint32_t high_first_x :1;
	uint32_t high_first_y :1;
	uint32_t high_first_z :1;
	uint32_t high_sign :1;
	uint32_t orient_1_0 :2;
	uint32_t orient_2 :1;
	uint32_t flat :1;
#elif BIG_ENDIAN == 1
	uint32_t high_first_x :1;
	uint32_t high_first_y :1;
	uint32_t high_first_z :1;
	uint32_t high_sign :1;
	uint32_t orient_1_0 :2;
	uint32_t orient_2 :1;
	uint32_t flat :1;
	uint32_t anym_first_x :1;
	uint32_t anym_first_y :1;
	uint32_t anym_first_z :1;
	uint32_t anym_sign :1;
	uint32_t tap_first_x :1;
	uint32_t tap_first_y :1;
	uint32_t tap_first_z :1;
	uint32_t tap_sign :1;
	uint32_t reserved :2;
	uint32_t high_g :1;
	uint32_t low_g :1;
	uint32_t drdy :1;
	uint32_t ffull :1;
	uint32_t fwm :1;
	uint32_t nomo :1;
	uint32_t step :1;
	uint32_t sigmot :1;
	uint32_t anym :1;
	/* pmu trigger will be handled later */
	uint32_t pmu_trigger_reserved :1;
	uint32_t d_tap :1;
	uint32_t s_tap :1;
	uint32_t orient :1;
	uint32_t flat_int :1;
#endif
};

/*!
 * @brief bmi160 interrupt status structure
 */
union bmi160_int_status {
	uint8_t data[4];
	struct bmi160_int_status_bits bit;
};

/*!
 * @brief bmi160 sensor data structure which comprises of accel data
 */
struct bmi160_sensor_data {
	/*! X-axis sensor data */
	int16_t x;
	/*! Y-axis sensor data */
	int16_t y;
	/*! Z-axis sensor data */
	int16_t z;
	/*! sensor time */
	uint32_t sensortime;
};

/*!
 * @brief bmi160 aux data structure which comprises of 8 bytes of accel data
 */
struct bmi160_aux_data {
	/*! Auxiliary data */
	uint8_t data[8];
};

/*!
 * @brief bmi160 FOC configuration structure
 */
struct bmi160_foc_conf {
	/*! Enabling FOC in gyro
	 * Assignable macros :
	 *  - BMI160_ENABLE
	 *  - BMI160_DISABLE
	 */
	uint8_t foc_gyr_en;

	/*! Accel FOC configurations
	 * Assignable macros :
	 *  - BMI160_FOC_ACCEL_DISABLED
	 *  - BMI160_FOC_ACCEL_POSITIVE_G
	 *  - BMI160_FOC_ACCEL_NEGATIVE_G
	 *  - BMI160_FOC_ACCEL_0G
	 */
	uint8_t foc_acc_x;
	uint8_t foc_acc_y;
	uint8_t foc_acc_z;

	/*! Enabling offset compensation for accel in data registers
	 * Assignable macros :
	 *  - BMI160_ENABLE
	 *  - BMI160_DISABLE
	 */
	uint8_t acc_off_en;

	/*! Enabling offset compensation for gyro in data registers
	 * Assignable macros :
	 *  - BMI160_ENABLE
	 *  - BMI160_DISABLE
	 */
	uint8_t gyro_off_en;
};

/*!
 * @brief bmi160 accel gyro offsets
 */
struct bmi160_offsets {
	/*! Accel offset for x axis */
	int8_t off_acc_x;
	/*! Accel offset for y axis */
	int8_t off_acc_y;
	/*! Accel offset for z axis */
	int8_t off_acc_z;
	/*! Gyro offset for x axis */
	int16_t off_gyro_x;
	/*! Gyro offset for y axis */
	int16_t off_gyro_y;
	/*! Gyro offset for z axis */
	int16_t off_gyro_z;
};

/*!
 * @brief FIFO aux. sensor data structure
 */
struct bmi160_aux_fifo_data {
	/*! The value of aux. sensor x LSB data */
	uint8_t aux_x_lsb;
	/*! The value of aux. sensor x MSB data */
	uint8_t aux_x_msb;
	/*! The value of aux. sensor y LSB data */
	uint8_t aux_y_lsb;
	/*! The value of aux. sensor y MSB data */
	uint8_t aux_y_msb;
	/*! The value of aux. sensor z LSB data */
	uint8_t aux_z_lsb;
	/*! The value of aux. sensor z MSB data */
	uint8_t aux_z_msb;
	/*! The value of aux. sensor r for BMM150 LSB data */
	uint8_t aux_r_y2_lsb;
	/*! The value of aux. sensor r for BMM150 MSB data */
	uint8_t aux_r_y2_msb;
};

/*!
 * @brief bmi160 sensor select structure
 */
enum bmi160_select_sensor {
	BMI160_ACCEL_ONLY = 1,
	BMI160_GYRO_ONLY,
	BMI160_BOTH_ACCEL_AND_GYRO
};

/*!
 * @brief bmi160 sensor step detector mode structure
 */
enum bmi160_step_detect_mode {
	BMI160_STEP_DETECT_NORMAL,
	BMI160_STEP_DETECT_SENSITIVE,
	BMI160_STEP_DETECT_ROBUST,
	/*! Non recommended User defined setting */
	BMI160_STEP_DETECT_USER_DEFINE
};

/*!
 * @brief enum for auxiliary burst read selection
 */
enum bm160_aux_read_len {
	BMI160_AUX_READ_LEN_0,
	BMI160_AUX_READ_LEN_1,
	BMI160_AUX_READ_LEN_2,
	BMI160_AUX_READ_LEN_3
};
/*!
 * @brief bmi160 sensor configuration structure
 */
struct bmi160_cfg {
	/*! power mode */
	uint8_t power;
	/*! output data rate */
	uint8_t odr;
	/*! range */
	uint8_t range;
	/*! bandwidth */
	uint8_t bw;
};

/*!
 * @brief Aux sensor configuration structure
 */
struct bmi160_aux_cfg {
	/*! Aux sensor, 1 - enable 0 - disable */
	uint8_t aux_sensor_enable : 1;
	/*! Aux manual/auto mode status */
	uint8_t manual_enable : 1;
	/*! Aux read burst length */
	uint8_t aux_rd_burst_len : 2;
	/*! output data rate */
	uint8_t aux_odr :4;
	/*! i2c addr of auxiliary sensor */
	uint8_t aux_i2c_addr;
};

/*!
 * @brief bmi160 interrupt channel selection structure
 */
enum bmi160_int_channel {
	/*! Un-map both channels */
	BMI160_INT_CHANNEL_NONE,
	/*! interrupt Channel 1 */
	BMI160_INT_CHANNEL_1,
	/*! interrupt Channel 2 */
	BMI160_INT_CHANNEL_2,
	/*! Map both channels */
	BMI160_INT_CHANNEL_BOTH
};

enum bmi160_int_types {
	/*! Slope/Any-motion interrupt */
	BMI160_ACC_ANY_MOTION_INT,
	/*! Significant motion interrupt */
	BMI160_ACC_SIG_MOTION_INT,
	/*! Step detector interrupt */
	BMI160_STEP_DETECT_INT,
	/*! double tap interrupt */
	BMI160_ACC_DOUBLE_TAP_INT,
	/*! single tap interrupt */
	BMI160_ACC_SINGLE_TAP_INT,
	/*! orientation interrupt */
	BMI160_ACC_ORIENT_INT,
	/*! flat interrupt */
	BMI160_ACC_FLAT_INT,
	/*! high-g interrupt */
	BMI160_ACC_HIGH_G_INT,
	/*! low-g interrupt */
	BMI160_ACC_LOW_G_INT,
	/*! slow/no-motion interrupt */
	BMI160_ACC_SLOW_NO_MOTION_INT,
	/*! data ready interrupt  */
	BMI160_ACC_GYRO_DATA_RDY_INT,
	/*! fifo full interrupt */
	BMI160_ACC_GYRO_FIFO_FULL_INT,
	/*! fifo watermark interrupt */
	BMI160_ACC_GYRO_FIFO_WATERMARK_INT,
	/*! fifo tagging feature support */
	BMI160_FIFO_TAG_INT_PIN
};

/*!
 * @brief bmi160 active state of any & sig motion interrupt.
 */
enum bmi160_any_sig_motion_active_interrupt_state {
	/*! Both any & sig motion are disabled */
	BMI160_BOTH_ANY_SIG_MOTION_DISABLED = -1,
	/*! Any-motion selected */
	BMI160_ANY_MOTION_ENABLED,
	/*! Sig-motion selected */
	BMI160_SIG_MOTION_ENABLED
};

struct bmi160_acc_tap_int_cfg {
#if LITTLE_ENDIAN == 1
	/*! tap threshold */
	uint16_t tap_thr :5;
	/*! tap shock */
	uint16_t tap_shock :1;
	/*! tap quiet */
	uint16_t tap_quiet :1;
	/*! tap duration */
	uint16_t tap_dur :3;
	/*! data source 0- filter & 1 pre-filter*/
	uint16_t tap_data_src :1;
	/*! tap enable, 1 - enable, 0 - disable */
	uint16_t tap_en :1;
#elif BIG_ENDIAN == 1
	/*! tap enable, 1 - enable, 0 - disable */
	uint16_t tap_en :1;
	/*! data source 0- filter & 1 pre-filter*/
	uint16_t tap_data_src :1;
	/*! tap duration */
	uint16_t tap_dur : 3;
	/*! tap quiet */
	uint16_t tap_quiet : 1;
	/*! tap shock */
	uint16_t tap_shock : 1;
	/*! tap threshold */
	uint16_t tap_thr : 5;
#endif
};

